src/svm-subsidiary.org
#+TITLE: Advanced Machine Learning Subsidary Notes
#+SUBTITLE: Lecture 17: Support Vector Machines

* Keywords
  * Support Vector Machines, maximum margins

* Main Points

** Overview
   * Support vector machines are one of the most successful machine
     learning techniques when dealing with small data sets
     - They perform binary classification (you need many SVMs to do
       multi-class classification)
     - There are support vector machines for regression SVR (but I'm
       not sure their performance dominates other techniques)
   * They are basically a perceptron that regularises itself by
     choosing the maximum margin separating plane
   * Of course perceptrons only work with linear separable data
     * SVMs overcome this limitations in two ways
       1. It often prejects the data into a high dimensional extended
          feature space making it more likely that the data is linear separable
	  + In the extended feature space the features will usually be
            non-linear functions of the original features, so we can
            separate data in the extended feature space that isn't
            necessarily linear separable in the original feature space
       2. It tolerates some errors using slack variables
	  + We need to tune a hyper-parameter (usually called $C$) to
            decide how much slack we want to tolerate
   * SVMs can work with a huge number of features by solving the
     problem in the dual space
     - The dual problem depends on the number of constraints
     - There is one constraint for each pattern which states that the
       pattern should be on or outside a margin
     - The dual problem only depends on the inner (dot) product
       between vectors in the (extended) feature space
     - As positive semi-definite kernels can be represented as inner
       product between vectors in an extended feature space (which are
       the eigen-functions of the kernel) we often never need to
       explicitly compute the vectors in the extended feature space

** Maximum Margins
   * We consider data $\mathcal{D} = \{(\bm{x}_k,y_k) | k=1,2,\ldots,
     m\}$ with $\bm{x}_k \in \mathbb{R}^p$ and $y_k\in\{-1,1\}$
   * We define a dividing hyper-plane by its orthogonal vector
     $\bm{w}$ and a threshold $b$ saying how far from the origin it is
   * The gap between the hyper-plane and a data point $(\bm{x}_k,y_k)$
     is given by
     $$ d_k = y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right) $$
     - Note that $y_k$ ensures the positive class is on one side of
       the dividing plane and the negative class on the other
   * We want to constrain these gaps to be greater than or equal to a margin
     $\Delta$
     $$ y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
     \geq \Delta $$
   * We can divide through by the margin size $\Delta$ giving
     $$ y_k \left(\ \bar{\bm{w}}^\tr \bm{x}_k - \bar{b} \right) \geq 1 $$
     - where $\bar{\bm{w}} = \bm{w}/(\Delta\,\|\bm{w}\|)$ and $\bar{b}
       = b/\Delta$
   * We note that
     $$ \frac{1}{2} \| \bar{\bm{w}}\|^2 = \frac{1}{2\,\Delta^2} $$
     - thus if we minimise $\| \bar{\bm{w}}\|^2/2$ subject to the
      constraint this is equivalent to maximising $\Delta$
     - the factor of a half is just for convenience
     - we minimise $\| \bar{\bm{w}}\|^2$ rather than $\| \bar{\bm{w}}\|$
       again for convenience
     - we will just drop the bar notation (i.e. we talk about $\bm{w}$ and $b$
       rather than $\bar{\bm{w}}$ and $\bar{b}$): after all what's in
       a name? (More seriously it has the same optimum whatever we
       call it)
   * *Soft Margins*
     - So far we have constrained all the data points to lie outside
       the margin (this is known as /hard margins/)
     - We can instead allow some data points to lie within the margin
       (or even be misclassified)
       - This is known as a /soft margin/ SVM
     - We do this by introducing slack variables $s_k$ so that our
       constraints become
       $$ y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
       \geq 1 - s_k $$
       (I've dropped the bars for simplicity)
     - We punish the slack variables by adding $C\,\sum\limits_{k=1}^m
       s_k$ to the objective function
     - We also constrain the slack variables so that $s_k\geq0$ (so we
       don't get a reward if $s_k<0$)
   * Optimisation problem
     * Our optimisation problem becomes 
       $$ \min_{\bm{w},b,\bm{s}} \quad \frac{ \|\bm{w}\|^2 }{2} + C \, \sum_{k=1}^m s_k $$
	subject to
	$$  y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
       \geq 1 - s_k  \quad \text{and} \quad s_k\geq0 $$
       for $k=1,\,2,\,\ldots,m$
     * We can write this as a Lagrange problem
       $$  \min_{\bm{w},b,\bm{s}} \; \max_{\bm{\alpha},\bm{\beta}} \quad
       \mathcal{L}(\bm{w}, b, \bm{s},\bm{\alpha}, \bm{\beta}) $$
       where
       $$ \mathcal{L}(\bm{w}, b, \bm{s},\bm{\alpha}, \bm{\beta}) =
       \frac{\|\bm{w}\|^2}{2} + C \, \sum_{k=1}^m s_k -  \sum_{k=0}^m
       \alpha_k \left(y_k \left( \bm{w}^\tr \bm{x}_k - b \right) - 1+
       s_k \right) - \sum_{k=0}^m         \beta_k \, s_k $$
       - $\alpha_k$ and $\beta_k$ are Lagrange multipliers
	 + $\alpha_k$ ensures the margin condition
	 + $\beta_k$ ensures the non-negativity of the slack variables
       - As they enforce inequality constraints we require they are
         non-negative

