src/svm-subsidiary.tex
% Created 2024-02-09 Fri 16:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper,margin=20mm]{geometry}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{stmaryrd}
\usepackage{bm}
\usepackage{minted}
\usemintedstyle{emacs}
\usepackage[T1]{fontenc}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\newcommand{\tr}{\textsf{T}}
\newcommand{\grad}{\bm{\nabla}}
\newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
\newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
\newcommand{\logg}[1]{\log\!\left( #1 \right)}
\newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
\newcommand{\e}[1]{{\rm e}^{#1}}
\newcommand{\dd}{\mathrm{d}}
\DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
\newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
\newcounter{eqCounter}
\setcounter{eqCounter}{0}
\newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
\newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
\newcommand{\argmax}{\mathop{\mathrm{argmax}}}
\newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
\author{Adam Prügel-Bennett}
\date{\today}
\title{Advanced Machine Learning Subsidary Notes\\\medskip
\large Lecture 17: Support Vector Machines}
\hypersetup{
 pdfauthor={Adam Prügel-Bennett},
 pdftitle={Advanced Machine Learning Subsidary Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Keywords}
\label{sec:org370e376}
\begin{itemize}
\item Support Vector Machines, maximum margins
\end{itemize}

\section{Main Points}
\label{sec:org43b8030}

\subsection{Overview}
\label{sec:org2514079}
\begin{itemize}
\item Support vector machines are one of the most successful machine
learning techniques when dealing with small data sets
\begin{itemize}
\item They perform binary classification (you need many SVMs to do
multi-class classification)
\item There are support vector machines for regression SVR (but I'm
not sure their performance dominates other techniques)
\end{itemize}
\item They are basically a perceptron that regularises itself by
choosing the maximum margin separating plane
\item Of course perceptrons only work with linear separable data
\begin{itemize}
\item SVMs overcome this limitations in two ways
\begin{enumerate}
\item It often prejects the data into a high dimensional extended
feature space making it more likely that the data is linear separable
\begin{itemize}
\item In the extended feature space the features will usually be
non-linear functions of the original features, so we can
separate data in the extended feature space that isn't
necessarily linear separable in the original feature space
\end{itemize}
\item It tolerates some errors using slack variables
\begin{itemize}
\item We need to tune a hyper-parameter (usually called \(C\)) to
decide how much slack we want to tolerate
\end{itemize}
\end{enumerate}
\end{itemize}
\item SVMs can work with a huge number of features by solving the
problem in the dual space
\begin{itemize}
\item The dual problem depends on the number of constraints
\item There is one constraint for each pattern which states that the
pattern should be on or outside a margin
\item The dual problem only depends on the inner (dot) product
between vectors in the (extended) feature space
\item As positive semi-definite kernels can be represented as inner
product between vectors in an extended feature space (which are
the eigen-functions of the kernel) we often never need to
explicitly compute the vectors in the extended feature space
\end{itemize}
\end{itemize}

\subsection{Maximum Margins}
\label{sec:org356a29d}
\begin{itemize}
\item We consider data \(\mathcal{D} = \{(\bm{x}_k,y_k) | k=1,2,\ldots,
     m\}\) with \(\bm{x}_k \in \mathbb{R}^p\) and \(y_k\in\{-1,1\}\)
\item We define a dividing hyper-plane by its orthogonal vector
\(\bm{w}\) and a threshold \(b\) saying how far from the origin it is
\item The gap between the hyper-plane and a data point \((\bm{x}_k,y_k)\)
is given by
$$ d_k = y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right) $$
\begin{itemize}
\item Note that \(y_k\) ensures the positive class is on one side of
the dividing plane and the negative class on the other
\end{itemize}
\item We want to constrain these gaps to be greater than or equal to a margin
\(\Delta\)
$$ y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
     \geq \Delta $$
\item We can divide through by the margin size \(\Delta\) giving
$$ y_k \left(\ \bar{\bm{w}}^\tr \bm{x}_k - \bar{b} \right) \geq 1 $$
\begin{itemize}
\item where \(\bar{\bm{w}} = \bm{w}/(\Delta\,\|\bm{w}\|)\) and \(\bar{b}
       = b/\Delta\)
\end{itemize}
\item We note that
$$ \frac{1}{2} \| \bar{\bm{w}}\|^2 = \frac{1}{2\,\Delta^2} $$
\begin{itemize}
\item thus if we minimise \(\| \bar{\bm{w}}\|^2/2\) subject to the
constraint this is equivalent to maximising \(\Delta\)
\item the factor of a half is just for convenience
\item we minimise \(\| \bar{\bm{w}}\|^2\) rather than \(\| \bar{\bm{w}}\|\)
again for convenience
\item we will just drop the bar notation (i.e. we talk about \(\bm{w}\) and \(b\)
rather than \(\bar{\bm{w}}\) and \(\bar{b}\)): after all what's in
a name? (More seriously it has the same optimum whatever we
call it)
\end{itemize}
\item \textbf{Soft Margins}
\begin{itemize}
\item So far we have constrained all the data points to lie outside
the margin (this is known as \emph{hard margins})
\item We can instead allow some data points to lie within the margin
(or even be misclassified)
\begin{itemize}
\item This is known as a \emph{soft margin} SVM
\end{itemize}
\item We do this by introducing slack variables \(s_k\) so that our
constraints become
$$ y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
       \geq 1 - s_k $$
(I've dropped the bars for simplicity)
\item We punish the slack variables by adding \(C\,\sum\limits_{k=1}^m
       s_k\) to the objective function
\item We also constrain the slack variables so that \(s_k\geq0\) (so we
don't get a reward if \(s_k<0\))
\end{itemize}
\item Optimisation problem
\begin{itemize}
\item Our optimisation problem becomes 
$$ \min_{\bm{w},b,\bm{s}} \quad \frac{ \|\bm{w}\|^2 }{2} + C \, \sum_{k=1}^m s_k $$
 subject to
 $$  y_k \left(\frac{ \bm{w}^\tr \bm{x}_k}{\|\bm{w}\|} -b \right)
       \geq 1 - s_k  \quad \text{and} \quad s_k\geq0 $$
for \(k=1,\,2,\,\ldots,m\)
\item We can write this as a Lagrange problem
$$  \min_{\bm{w},b,\bm{s}} \; \max_{\bm{\alpha},\bm{\beta}} \quad
       \mathcal{L}(\bm{w}, b, \bm{s},\bm{\alpha}, \bm{\beta}) $$
where
$$ \mathcal{L}(\bm{w}, b, \bm{s},\bm{\alpha}, \bm{\beta}) =
       \frac{\|\bm{w}\|^2}{2} + C \, \sum_{k=1}^m s_k -  \sum_{k=0}^m
       \alpha_k \left(y_k \left( \bm{w}^\tr \bm{x}_k - b \right) - 1+
       s_k \right) - \sum_{k=0}^m         \beta_k \, s_k $$
\begin{itemize}
\item \(\alpha_k\) and \(\beta_k\) are Lagrange multipliers
\begin{itemize}
\item \(\alpha_k\) ensures the margin condition
\item \(\beta_k\) ensures the non-negativity of the slack variables
\end{itemize}
\item As they enforce inequality constraints we require they are
non-negative
\end{itemize}
\end{itemize}
\end{itemize}
