src/svm-subsidiary.tex

\subsection{Extended Feature Space}
\label{sec:org8333e49}
\begin{itemize}
\item To help linear separability we can map our inputs to a
high-dimensional feature space
$$ \bm{x} \rightarrow \bm{\phi}(\bm{x}) $$
\item Note in the slides I wrote this as \(\vec{\phi}(\bm{x})\) to
make it clear that this is a different feature space (I won't
do it here as it is a slightly ugly way of writing vectors)
\item Note this is a function of the original feature vector
meaning that if I change \(\bm{x}\) I will get a different
vector \(\bm{\phi}(\bm{x})\)
\item Nevertheless \(\bm{\phi}(\bm{x})\) is just a \(p'\) dimensional
vector
\item We call the space of \(\bm{\phi}(\bm{x})\) the \emph{extended
feature space}
\item We can define this extended feature mapping explicitly (e.g. we
might decide that \(\phi_1(\bm{x}) = x_1^2\), \(\phi_2(\bm{x}) =
       x_1\,x_2\), etc.)
\item More often this feature mapping is defined implicitly through
a kernel function (more of that later)
\item We usually choose the dimensionality, \(p'\), of the extended feature
space to be much larger that that of the original feature space
\item Usually we would be scared of this because it can lead to over-fitting
\item However, because of choosing the maximal-margin hyper-plane
this regularises the problem so strongly that we get good
generalisation despite working in an enormous dimensional space
\item The Lagrange problem in this extended feature space is
$$ \mathcal{L}(\bm{w}, b, \bm{s},\bm{\alpha}, \bm{\beta}) =
       \frac{\|\bm{w}\|^2}{2} + C \, \sum_{k=1}^m s_k -  \sum_{k=0}^m
       \alpha_k \left( y_k \left( \bm{w}^\tr \bm{\phi}(\bm{x}_k) - b
       \right) - 1 + s_k \right) - \sum_{k=0}^m   \beta_k \, s_k $$
\begin{itemize}
\item Note that the weight vector, \(\bm{w}\), is now in the extended weight space
\end{itemize}
\end{itemize}

\subsection{Dual Problem}
\label{sec:org86b360f}
\begin{itemize}
\item To obtain the dual problem we compute the minimum of the
Lagrangian with respect to \(\bm{w}\), \(b\) and \(\bm{s}\)
\begin{itemize}
\item Weight minimisation
$$ \grad_{\bm{x}} \mathcal{L} = \bm{w} - \sum_{k=1}^m
       \alpha_k\,y_k\,\bm{\phi}(\bm{x}_k) = 0 $$
\begin{itemize}
\item So that \(\bm{w} = \sum\limits_{k=1}^m \alpha_k\,y_k\,\bm{\phi}(\bm{x}_k)\)
\end{itemize}
\item Threshold minimisation
$$ \frac{\partial \mathcal{L}}{\partial b} = -\sum_{k=1}^m
       \alpha_k\,y_k = 0 $$
\begin{itemize}
\item This gives us a global constraint on the Lagrange multipliers \(\alpha_k\)
\end{itemize}
\item Slack variable minimisation
$$ \frac{\partial \mathcal{L}}{\partial s_k} = C - \alpha_k
       -\beta_k = 0 $$
\begin{itemize}
\item Thus \(\alpha_k = C - \beta_k\)
\item When substituting back into the Lagrangian all the terms
proportional to \(s_k\) cancel
\item But \(\beta_m\geq0\) so this implies \(\alpha_k \leq C\) (recall
that \(\alpha_k\geq0\) from the KKT condition)
\end{itemize}
\end{itemize}
\item Substituting the optimal values of \(\bm{w}\), \(b\) and \(\bm{S}\)
into the Lagrangian we obtain the dual problem
$$ \max_{\bm{\alpha}}\;- \frac{1}{2} \sum_{k,l=0}^m
     \alpha_k\,\alpha_l \,
     y_k\,y_l\, \bm{\phi}^\tr(\bm{x}_k) \, \bm{\phi}(\bm{x}_l) +
     \sum_{k=0}^m \alpha_k$$
\hspace{6cm} \emph{subject to the conditions}
$$ \sum_{k=1}^m \alpha_k\, y_k=0, \quad \quad \forall_k  \; 0 \geq
     \alpha_k\geq C $$
\begin{itemize}
\item Note that a large number of terms vanished (you really need to
go through this carefully to see that this happens)
\item Amazingly adding slack variables is equivalent to preventing
\(\alpha_k\) becoming larger than \(C\)
\item the dual problem is another quadratic programming problem but
involves the \(m\) Lagrange multipliers \(\alpha_k\) rather than
the \(p'\) weights
\item importantly the dual problem depends only on
\(\bm{\phi}(\bm{x}_k)\) through the inner product
\(\bm{\phi}^\tr(\bm{x}_k) \, \bm{\phi}(\bm{x}_l)\)
\end{itemize}
\end{itemize}

\subsection{Working in the extended feature space}
\label{sec:org319ddd7}
\begin{itemize}
\item If we work in the original feature space then the dual problem
depends on the inner (dot) product \(\bm{x}_k^\tr \bm{x}_l\)
\begin{itemize}
\item this is known as a linear SVM
\item quite often a linear SVM gives the best performance
\item sometimes it will pay to solve the primal problem rather than
dual problem
\item however we can work with very high dimensional feature vectors
\begin{itemize}
\item this is useful when we work with text where out input vectors
are naturally high dimensional
\item In this case we would want to solve the dual problem
\end{itemize}
\end{itemize}
\item We can explicitly define our extended feature vectors
\begin{itemize}
\item this has the disadvantage that they could be expensive to
compute, but for some applications there may be smart ways of
doing this
\end{itemize}
\item \textbf{Kernel Trick}
\begin{itemize}
\item There is however a really nice trick
\item Any positive definite kernel, \(K(\bm{x},\bm{y})\), can be
decomposed as
$$ K(\bm{x},\bm{y}) =\bm{\phi}^\tr(\bm{x}) \, \bm{\phi}(\bm{y}) $$ 
(we will talk much more about this in the next lecture)
\item obviously the functions \(\phi_i(\bm{x})\) that form the elements
of the vector \(\bm{\phi}(\bm{x})\) depend on the kernel we choose
\item However, as the dual problem only depends on the inner product
\(\bm{\phi}^\tr(\bm{x}) \, \bm{\phi}(\bm{y})\) if we choose these
so that \(\bm{\phi}^\tr(\bm{x}) \, \bm{\phi}(\bm{y}) =
       K(\bm{x},\bm{y})\) then we never have to explicitly compute
\(\bm{\phi}(\bm{x})\)
\item Our dual problem in this case is
$$ \max_{\bm{\alpha}}\;- \frac{1}{2} \sum_{k,l=0}^m
        \alpha_k\,\alpha_l \,
          y_k\,y_l\, K(\bm{x}_k,\bm{x}_l) +
           \sum_{k=0}^m \alpha_k$$
\item In using an SVM we have to determine which side of the dividing
plane a new data point, \(\bm{x}\), would lie
\begin{itemize}
\item Our prediction would be
$$ \mathrm{sgn}\!\left(\bm{w}^\tr \bm{\phi}(\bm{x}) -b\right) $$
\begin{itemize}
\item the function \(\mathrm{sgn}(\cdot)\) outputs \(\pm1\) depending on the
sign of the argument
\end{itemize}
\item But our optimal weight vector is given by \(\bm{w} =
         \sum\limits_{k=1}^m \alpha_k\,y_k\,\bm{\phi}(\bm{x}_k)\)
\item Thus our prediction will be
$$ \mathrm{sgn}\!\left(  \sum_{k=1}^m
         \alpha_k\,y_k\,\bm{\phi}^\tr(\bm{x}_k)\,\bm{\phi}(\bm{x})
         -b\right)  =  \mathrm{sgn}\!\left(  \sum_{k=1}^m
         \alpha_k\,y_k\,K(\bm{x}_k,\bm{x})-b\right)  $$
\item Thus we don't need to computer the weight or the extended
feature vectors
\end{itemize}
\end{itemize}
\end{itemize}
