src/svm-subsidiary.org
** Practical Consideration
   * To get SVMs to work in practice requires a lot of tuning
   * Firstly you need to normalise the inputs
   * You might need to *balance* you data set
     - SVMs perform poorly on problems where the training set has many
       more examples of one class than the other
     - You can balance the data set by ignoring examples from the
       large class or
     - Increasing the size of minority class by duplicating examples
     - Sometimes you can use data augmentation on the minority class
     - This is only a problem where the data set is strongly unbalanced
   * You need to choose $C$ (this can vary by orders of magnitudes)
     - Typically found by exhaustive search start at $2^{-5}$ and
       doubling until you reach $2^{15}$
     - You decide on what to use by testing on a validation set
   * You also have to choose the right kernel
     - This could be no kernel (linear SVM)
     - A polynomial kernel (you have to try different degrees)
     - A radial basis kernel
     - Sometimes you use a special designed kernel for the problem
     - Kernels also come with hyper-parameters (often called $\gamma$)
       which you also have to tune
   * It is a lot of work but for many problems (particularly with
     small training set) it often leads to state-of-the-art performance
   * *Multi-Class Classification*
     - Natively SVMs only perform binary classification
     - If you have multiple classes you need multiple SVMs
     - People use two strategies
       + /One-versus-all/: for each class train a separate SVM
         using all other classes as negative examples (but see note on
         balancing)
       + /All-pairs/:  Train a set of SVM between all pairs of classes
         (this is obviously expensive when you have large classes)
     - You then have to get your SVMs to vote in some way to determine
       the true class



* Experiments

** SVM in Practice
   * SVMs are hard to code (they need a quadratic programming solver
     which are complicate)
   * However, there a lots of good implementations out there so have a go
   * Stolen from the web\ldots

#+BEGIN_SRC python
#Import scikit-learn dataset library
from sklearn import datasets

#Load dataset
cancer = datasets.load_breast_cancer()
# print the names of the 13 features
print("Features: ", cancer.feature_names)

# print the label type of cancer('malignant' 'benign')
print("Labels: ", cancer.target_names)

# print data(feature)shape
cancer.data.shape

# Import train_test_split function
from sklearn.model_selection import train_test_split

# Split dataset into training set and test set
X_train, X_test, y_train, y_test  =
          train_test_split(cancer.data, cancer.target, test_size=0.3,random_state=109) 
                                # 70% training and 30% test

#Import svm model
from sklearn import svm

#Create a svm Classifier
clf = svm.SVC(kernel='linear') # Linear Kernel

#Train the model using the training sets
clf.fit(X_train, y_train)

#Predict the response for test dataset
y_pred = clf.predict(X_test)

#Import scikit-learn metrics module for accuracy calculation
from sklearn import metrics

# Model Accuracy: how often is the classifier correct?
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

# Model Precision: what percentage of positive tuples are labeled as such?
print("Precision:",metrics.precision_score(y_test, y_pred))

# Model Recall: what percentage of positive tuples are labelled as such?
print("Recall:",metrics.recall_score(y_test, y_pred))


#+END_SRC
* COMMENT [[file:svm.pdf][PDF]] [[file:pdf/svm_prn.pdf][print]]
* COMMENT [[file:convexity-subsidiary.org][Previous]] [[file:kernelTrick-subsidiary.org][Next]]
* Options                                                  :ARCHIVE:noexport:
#+BEGIN_OPTIONS
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[a4paper,margin=20mm]{geometry}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{stmaryrd}
#+LATEX_HEADER: \usepackage{bm}
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{emacs}
#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage[scaled]{beraserif}
#+LaTeX_HEADER: \usepackage[scaled]{berasans}
#+LaTeX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \newcommand{\tr}{\textsf{T}}
#+LATEX_HEADER: \newcommand{\grad}{\bm{\nabla}}
#+LATEX_HEADER: \newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\logg}[1]{\log\!\left( #1 \right)}
#+LATEX_HEADER: \newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
#+LATEX_HEADER: \newcommand{\e}[1]{{\rm e}^{#1}}
#+LATEX_HEADER: \newcommand{\dd}{\mathrm{d}}
#+LATEX_HEADER: \DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
#+LATEX_HEADER: \newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
#+LATEX_HEADER: \newcounter{eqCounter}
#+LATEX_HEADER: \setcounter{eqCounter}{0}
#+LATEX_HEADER: \newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
#+LATEX_HEADER: \newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
#+LATEX_HEADER: \newcommand{\argmax}{\mathop{\mathrm{argmax}}}
#+LATEX_HEADER: \newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
#+END_OPTIONS

