src/svm-subsidiary.tex

\subsection{Practical Consideration}
\label{sec:org352fd14}
\begin{itemize}
\item To get SVMs to work in practice requires a lot of tuning
\item Firstly you need to normalise the inputs
\item You might need to \textbf{balance} you data set
\begin{itemize}
\item SVMs perform poorly on problems where the training set has many
more examples of one class than the other
\item You can balance the data set by ignoring examples from the
large class or
\item Increasing the size of minority class by duplicating examples
\item Sometimes you can use data augmentation on the minority class
\item This is only a problem where the data set is strongly unbalanced
\end{itemize}
\item You need to choose \(C\) (this can vary by orders of magnitudes)
\begin{itemize}
\item Typically found by exhaustive search start at \(2^{-5}\) and
doubling until you reach \(2^{15}\)
\item You decide on what to use by testing on a validation set
\end{itemize}
\item You also have to choose the right kernel
\begin{itemize}
\item This could be no kernel (linear SVM)
\item A polynomial kernel (you have to try different degrees)
\item A radial basis kernel
\item Sometimes you use a special designed kernel for the problem
\item Kernels also come with hyper-parameters (often called \(\gamma\))
which you also have to tune
\end{itemize}
\item It is a lot of work but for many problems (particularly with
small training set) it often leads to state-of-the-art performance
\item \textbf{Multi-Class Classification}
\begin{itemize}
\item Natively SVMs only perform binary classification
\item If you have multiple classes you need multiple SVMs
\item People use two strategies
\begin{itemize}
\item \emph{One-versus-all}: for each class train a separate SVM
using all other classes as negative examples (but see note on
balancing)
\item \emph{All-pairs}:  Train a set of SVM between all pairs of classes
(this is obviously expensive when you have large classes)
\end{itemize}
\item You then have to get your SVMs to vote in some way to determine
the true class
\end{itemize}
\end{itemize}



\section{Experiments}
\label{sec:org759da99}

\subsection{SVM in Practice}
\label{sec:orge676d83}
\begin{itemize}
\item SVMs are hard to code (they need a quadratic programming solver
which are complicate)
\item However, there a lots of good implementations out there so have a go
\item Stolen from the web\ldots
\end{itemize}

\begin{minted}[]{python}
#Import scikit-learn dataset library
from sklearn import datasets

#Load dataset
cancer = datasets.load_breast_cancer()
# print the names of the 13 features
print("Features: ", cancer.feature_names)

# print the label type of cancer('malignant' 'benign')
print("Labels: ", cancer.target_names)

# print data(feature)shape
cancer.data.shape

# Import train_test_split function
from sklearn.model_selection import train_test_split

# Split dataset into training set and test set
X_train, X_test, y_train, y_test  =
	  train_test_split(cancer.data, cancer.target, test_size=0.3,random_state=109) 
				# 70% training and 30% test

#Import svm model
from sklearn import svm

#Create a svm Classifier
clf = svm.SVC(kernel='linear') # Linear Kernel

#Train the model using the training sets
clf.fit(X_train, y_train)

#Predict the response for test dataset
y_pred = clf.predict(X_test)

#Import scikit-learn metrics module for accuracy calculation
from sklearn import metrics

# Model Accuracy: how often is the classifier correct?
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

# Model Precision: what percentage of positive tuples are labeled as such?
print("Precision:",metrics.precision_score(y_test, y_pred))

# Model Recall: what percentage of positive tuples are labelled as such?
print("Recall:",metrics.recall_score(y_test, y_pred))


\end{minted}
\end{document}
